---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.ParameterFailures
source: html/44455b41-9611-cf82-65a1-2f208dcf5de9.htm
---
# BuiltInFailures.ParameterFailures Properties

The shared parameter '...' cannot be added with name '...' and type '...' because it conflicts with the existing name '...' and type '...'.